---
kind: method
id: M:Autodesk.Revit.DB.KeyBasedTreeEntriesIterator.Dispose
source: html/77d7ff26-f814-959a-dd64-9906efd5e228.htm
---
# Autodesk.Revit.DB.KeyBasedTreeEntriesIterator.Dispose Method

Releases all resources used by the KeyBasedTreeEntriesIterator

## Syntax (C#)
```csharp
public void Dispose()
```